var CheckTools = {
    
    //用户名正则，4到16位（字母，数字，下划线，减号）
    UserNameRegExp: /^[a-zA-Z0-9_-]{4,16}$/,

    //密码强度正则，6-16位，包括至少1个大写字母，1个小写字母
    PasswordRegExp: /^.*(?=.{6,16})(?=.*[A-Z])(?=.*[a-z]).*$/,

    //密码强度正则，6-16位，包括至少1个大写字母，1个小写字母，1个数字，1个特殊字符
    PasswordRegExp_Secure: /^.*(?=.{6,16})(?=.*\d)(?=.*[A-Z])(?=.*[a-z])(?=.*[!@#$%^&*? ]).*$/,
    
    //Email正则
    EmailRegExp: /^([A-Za-z0-9_\-\.])+\@([A-Za-z0-9_\-\.])+\.([A-Za-z]{2,4})$/,
    
    //手机号正则
    PhoneNumRegExp: /^((13[0-9])|(14[5|7])|(15([0-3]|[5-9]))|(18[0,5-9]))\d{8}$/,
}

export default CheckTools